In [1]:
import numpy as np
immport pandas as pd

SyntaxError: invalid syntax (<ipython-input-1-ee874e980b20>, line 2)

In [ ]:
import pandas

In [2]:
import pandas as pd

In [3]:
dict1={
    "name":['hakeemullah',"ahmed","ali","jaafar"],
    "marks":[45,78,43,90],
    "city":['karachi',"islamabad","lahore","peshawar"]
}

In [5]:
dict1

{'name': ['hakeemullah', 'ahmed', 'ali', 'jaafar'],
 'marks': [45, 78, 43, 90],
 'city': ['karachi', 'islamabad', 'lahore', 'peshawar']}

In [8]:
df=pd.DataFrame(dict1)

In [9]:
df

          name  marks       city
0  hakeemullah     45    karachi
1        ahmed     78  islamabad
2          ali     43     lahore
3       jaafar     90   peshawar

In [10]:
df.to_csv('results.csv')

In [11]:
df.to_csv('results_false_Index.csv',index=False)

In [13]:
df.head(2)

          name  marks       city
0  hakeemullah     45    karachi
1        ahmed     78  islamabad

In [14]:
df.tail(2)

     name  marks      city
2     ali     43    lahore
3  jaafar     90  peshawar

In [15]:
df.describe()

           marks
count   4.000000
mean   64.000000
std    23.622024
min    43.000000
25%    44.500000
50%    61.500000
75%    81.000000
max    90.000000

In [21]:
harry=pd.read_csv('harry.csv')

In [22]:
harry

   Train No  Speed       city
0     23232     45    karachi
1     34343     78  islamabad
2   4343434     43     lahore
3   3232323     90   peshawar

In [23]:
harry['Speed']

0    45
1    78
2    43
3    90
Name: Speed, dtype: int64

In [24]:
harry.city

0      karachi
1    islamabad
2       lahore
3     peshawar
Name: city, dtype: object

In [25]:
harry['Speed'][0]=900

C:\Users\hakeemullah\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [26]:
harry

   Train No  Speed       city
0     23232    900    karachi
1     34343     78  islamabad
2   4343434     43     lahore
3   3232323     90   peshawar

In [27]:
harry.to_csv('harry.csv')

In [29]:
harry.index=['first','second','third','forth']

In [30]:
harry

        Train No  Speed       city
first      23232    900    karachi
second     34343     78  islamabad
third    4343434     43     lahore
forth    3232323     90   peshawar